# languages
brew "go"
brew "node"
brew "rust"
brew "terraform"

# language tooling
brew "golangci-lint"

# cli utilities
brew "bat"
brew "dust"
brew "fd"
brew "fx"
brew "fzf"
brew "git-standup"
brew "glow"
brew "gum"
brew "httpie"
brew "jc"
brew "jq"
brew "lsd"
brew "pcre"
brew "ripgrep"
brew "yq"
brew "zoxide"

# developer tools
brew "act"
brew "awscli"
brew "buf"
brew "dive"
brew "gh"
brew "ghz"
brew "graphviz"
brew "grpcurl"
brew "hey"
brew "k9s"
brew "ko"
brew "lazygit"
brew "mage"
brew "neovim"
brew "oauth2l"
brew "temporal"

tap "mongodb/brew"
brew "mongodb-community"

tap "deviceinsight/packages"
brew "deviceinsight/packages/kafkactl"

# kubernetes
brew "helm"
brew "kubectl"
brew "kubectx"

tap "robusta-dev/homebrew-krr"
brew "krr"

# misc
brew "bottom"
brew "chezmoi"
brew "mas"
brew "slides"
brew "silicon"

tap "teamookla/speedtest"
brew "speedtest"

# font
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"

# apps
cask "1password-cli"
cask "docker"
cask "google-chrome"
cask "firefox"
cask "mongodb-compass"
cask "nightfall"
cask "postman"
cask "slack"
cask "warp"
