# language manager
brew "asdf"

brew "go"

# cli utilities
brew "atuin"
brew "bat"
brew "bottom"
brew "dust"
brew "fd"
brew "fish"
brew "fzf"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "gum"
brew "httpie"
brew "jc"
brew "jq"
brew "ko"
brew "lsd"
brew "pcre"
brew "ripgrep"
brew "rm-improved"
brew "starship"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tpm"
brew "watch"
brew "yq"
brew "zellij"
brew "zoxide"

# developer tools
brew "awscli"
tap "bufbuild/buf"
brew "bufbuild/buf/buf"
brew "dive"
brew "gh"
brew "grpcurl"
brew "helm"
brew "helmfile"
brew "hey"
brew "k9s"
brew "lazygit"
brew "neovim"
brew "sops"

# misc
cask "bartender"
brew "chezmoi"
cask "deskpad"
brew "hugo"
brew "mas"
brew "slides"

tap "teamookla/speedtest"
brew "speedtest"

# font
cask "font-jetbrains-mono-nerd-font"
cask "font-iosevka-nerd-font"

# apps
cask "1password-cli"
cask "arc"
cask "docker"
cask "google-chrome"
cask "firefox"
cask "intellij-idea"
cask "nightfall"
cask "obsidian"
cask "postman"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "wezterm"

